Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་གྱི་ལེའུ་ལས་ཞེས་བྱ་བ་ནི་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འབྲིང་དུ་བཤད་པ་དེ་དག་ཐམས་ཅད་ནི་རབ་འབྱོར་གྱི་ལེའུ་ཞེས་བྱའོ།
en: In Subhūti’s chapter”— “Subhūti’s chapter” is all of the intermediate exegesis of the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་ཏེ་བྱུང་བའི་ཕྱིར། དེ་བཤད་པ་ཡང་དེ་ནི་དེ་ལས་གཟུང་བར་བྱའོ་ཞེས་བསྟན་ཏོ།
en: This is saying that the knowledge of all aspects has originated based on the perfection of wisdom, so you should grasp the explanation of it also from there.

source: །ཆོས་ཟབ་མོ་བཤད་པ་ནི་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ཡིན་ན་རབ་འབྱོར་སྨོས་པ་ལྷའི་དབང་པོས་མ་བཟོད་ནས་འཕགས་པ་རབ་འབྱོར་འདི་ལྟར་བཤད་པའི་སྐབས་ཕྱེ་བ་དེ་ཁྱོད་ཀྱི་བྱིན་གྱི་རླབས་སམ། དེ་ཁྱོད་ཀྱི་མཐུའམ་ཞེས་དྲིས་སོ། །དེ་སྐད་སྨྲས་པ་དང་།
en: The sustaining power of the tathāgata Given that the exegesis of the deep dharmas is within the range of a tathāgata, the chief of the gods does not accept that it is Subhūti’s explanation, so, setting the scene for the noble Subhūti to have given such an exegesis, he asks, “Is it through your noble might, is it through your sustaining power…?”

source: གནས་བརྟན་རབ་འབྱོར་གྱིས། དང་པོར་ཀུན་རྫོབ་ཀྱི་ཚུལ་གྱིས་འདི་དག་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཡིན་ཏེ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དགྲ་བཅོམ་པ་དག་ཆོས་འཆད་དོ་ཞེས་བསྟན་ཏོ།
en: First the elder Subhūti, in conventional mode, teaches that these are “the Tathāgata’s sustaining power,” that is, worthy ones give explanations of doctrine through the Tathāgata’s sustaining power.

source: དེ་ནས་བརྒྱ་བྱིན་གྱིས་དེ་ཡང་མ་བཟོད་ནས། བཙུན་པ་རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བྱིན་གྱི་རླབས་མེད་ན་ཅིའི་ཕྱིར་དེ་སྐད་དུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་སོ་ཞེས་སྨྲ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then the chief of the gods, not accepting that either, says “Venerable monk Subhūti, given that all dharmas are without anything that sustains them, why do you say ‘this is the Tathāgata’s sustaining power, it is the Tathāgata’s might’?”

source: །དེ་ནས་གནས་བརྟན་གྱིས་ཚིག་དེ་ལ་རྗེས་སུ་ཡི་རང་ནས། དོན་དམ་པའི་ཚུལ་དུ་ན་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དེ་བཞིན་ཉིད་ལ་བྱ་བ་བསྟན་པའི་ཕྱིར་བྱིན་གྱི་རླབས་མེད་པའི་ཆོས་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་ཞེས་བྱ་བ་ལ་སོགས་པས་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་མེད་དོ་ཞེས་སྟོན་ཏོ།
en: Then the elder, having rejoiced in that statement, to teach that in ultimate mode the tathāgata is to be taken as tathatā, with “the tathāgata cannot be apprehended in the true nature of dharmas that is without anything that sustains it,” and so on, teaches that there is no dharma called tathāgata at all.

source: །ཆོས་ཉིད་ལ་ཀུན་བརྟགས་པའི་ཆོས་མེད་པའི་ཕྱིར་བྱིན་གྱི་རླབས་མེད་པའི་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་མེད་དོ།
en: There are no false imagined dharmas in the true nature of dharmas, so “in” that “true dharmic nature” of all dharmas “without anything that sustains it” there is no “tathāgata.”

source: །ཆོས་ཉིད་ལས་མ་གཏོགས་པའི་ཆོས་རྣམས་མེད་པའི་ཕྱིར་བྱིན་གྱི་རླབས་མེད་པའི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: And because there are no dharmas unincluded in the true nature of dharmas, “nor can the tathāgata be apprehended elsewhere than the true nature of dharmas that is without anything that sustains it.”

source: །ཀུན་བརྟགས་པ་ལ་ཆོས་ཉིད་མི་གནས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་ཡང་བྱིན་གྱི་རླབས་མེད་པའི་ཆོས་མི་དམིགས་སོ། །ཆོས་ལས་གུད་ན་ཆོས་ཉིད་མེད་པའི་ཕྱིར།
en: Because the true nature of dharmas does not abide in falsely imagined phenomena, “the true nature of dharmas that is without anything that sustains it cannot be apprehended in the tathāgata.”

source: དེ་བཞིན་གཤེགས་པ་ལས་གུད་ན་ཡང་བྱིན་གྱི་རླབས་མེད་པའི་ཆོས་ཉིད་མི་དམིགས་སོ།
en: And because there is no true nature of dharmas elsewhere than dharmas, “nor can the true nature of dharmas that is without anything that sustains it be apprehended elsewhere than the tathāgata.”

source: །དེ་བཞིན་དུ་དེ་བཞིན་ཉིད་ཀྱི་འགྲེས་ལ་ཡང་སྦྱར་རོ། །དེ་བཞིན་དུ་གཟུགས་ལ་སོགས་པ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་ཆོས་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་འགྲེས་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Construe the “suchness” section like this, and construe the “true dharmic nature” and “suchness” of “form,” and so on, ending with “the knowledge of all aspects” section like this as well. “

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ནི་གཟུགས་ཀྱི་ཆོས་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: The true dharmic nature of the tathāgata is not conjoined with or disjoined from the true dharmic nature of form. …

source: །གཟུགས་ཀྱི་ཆོས་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན།
en: It is not conjoined with or disjoined from something other than the true dharmic nature of form.”

source: བྲལ་བ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཐ་དད་པ་མེད་དེ་གཅིག་པའི་ཕྱིར་དེ་སྐད་བསྟན་ཏོ། །གནས་དང་གནས་པའི་དངོས་པོ་དང་།
en: It says so because they are not different, they are the same.

source: གཞན་གྱི་དངོས་པོ་དང་ལྡན་པ་དང་བྲལ་བའི་རྣམ་པར་རྟོག་པ་དག་ནི་ཐ་དད་པ་ཡོད་ན་རིགས་ཀྱི་མེད་ན་མི་རིགས་སོ།
en: The alternatives when a basis is conjoined with something on a basis or with something else, or disjoined from them, are that they are acceptable if they are different and not acceptable if they are not.

source: །དེ་བཞིན་དུ་དེ་བཞིན་ཉིད་ཀྱི་འགྲེས་ལ་ཡང་། ཀཽ་ཤི་ཀ་འདི་ནི་དེ་ལྟར་གང་ཆོས་ཐམས་ཅད་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན་པ་དེའི་མཐུའོ། །འདི་ནི་དེའི་བྱིན་གྱི་རླབས་སོ་ཞེས་སྦྱར་བར་བྱ་སྟེ།
en: Construe “thus, Kauśika, not being conjoined with and not being disjoined from all dharmas—this is its might, this is its sustaining power,” in the suchness section, in the same way.

source: སྟོང་པ་ཉིད་ཀྱི་མཐུ་དང་སྟོང་པ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་ཏེ། བཤད་པ་དེ་སྟོང་པ་ཉིད་ལས་བརྩམས་ནས་བྱུང་བའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It is the “might” of emptiness, the “sustaining power” of emptiness, in the sense that the explanation has come about taking emptiness as the point of departure. “

source: །གཟུགས་ལས་ཀྱང་བཙལ་བར་མི་བྱ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པ་མེད་པའི་ཕྱིར་དེ་སྐད་བསྟན་ཏོ། གཟུགས་ལས་གཞན་དུ་ཡང་བཙལ་བར་མི་བྱའོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་ཐ་དད་པ་མེད་དོ་ཞེས་ཐ་དད་པ་མེད་པར་བསྟན་ཏོ།
en: They also should not look for it in form”— it says this because form and so on do not exist— “and they should not look for it elsewhere than form.” It says this because the perfection of wisdom is something that does not exist, so it is not something else either.

source: །དེའི་ཕྱིར་ཡོད་པ་མ་ཡིན་ཐ་དད་པ་མ་ཡིན་པར་བསྟན་པའི་ཕྱིར་རོ།
en: Therefore, it is teaching that because something does not exist it is not something else.

source: །ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན་ཏེ། འདི་ལྟར་མཚན་ཉིད་མེད་པའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: It says “all dharmas… are not conjoined, are not disjoined… and have… no mark.” “

source: །གཟུགས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་གཟུགས་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཉིས་ཀ་ཡང་ཡོད་པ་མ་ཡིན་པར་བསྟན་པའོ། །གཟུགས་ལས་གུད་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་ཡོད་པ་མ་ཡིན་པ་ཉིད་ཀྱི་ཕྱིར་ཐ་དད་པར་བརྗོད་དུ་མི་རུང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་བས་ན།
en: Form is not the perfection of wisdom” teaches that both form and the perfection of wisdom are things that do not exist; “and there is no perfection of wisdom other than form” means you cannot say it is different, because it is something that does not exist.

source: ཀཽ་ཤི་ཀ་འདི་ལྟར་ཆོས་འདི་དག་ཐམས་ཅད་ནི་ཡོད་པ་མ་ཡིན་ཏེ་དམིགས་སུ་མེད་དོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: And so it says, “Kauśika, it is because all these dharmas do not exist and cannot be apprehended.”

source: །དེ་ནས་ཡང་ཆོས་བཤད་པ་འདི་ངོ་མཚར་དུ་གཟུང་བར་བསྟན་པའི་ཕྱིར་བརྒྱ་བྱིན་གྱིས་ཚིག་རྣམ་པ་བཞི་བཀོད་དེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆེ་བ་སྟེ་ཞེས་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཚད་མེད་པ་སྟེ་ཞེས་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་དཔག་ཏུ་མེད་པ་སྟེ་ཞེས་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་མཐའ་ཡས་པ་སྟེ་ཞེས་བྱ་བའོ།
en: The perfection of wisdom is great, immeasurable, infinite, and limitless Then Śatakratu, to teach again that this exposition of the doctrine should be taken to be amazing, makes a fourfold statement that “The perfection of wisdom… is great… the perfection of wisdom… is immeasurable… the perfection of wisdom… is infinite… [and] the perfection of wisdom… is limitless.”

source: །གཟུགས་ཀྱི་སྔོན་གྱི་མཐའ་མི་དམིགས་ཞེས་བྱ་བ་ནི་དེའི་ཚེ་བྱུང་ངོ་ཞེས་བྱ་བའམ་མ་བྱུང་ངོ་ཞེས་བྱ་བར་སྦྱར་རོ། །ཕྱི་མའི་མཐའ་མི་དམིགས་ཞེས་བྱ་བ་ནི་དེའི་ཚེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའམ། འབྱུང་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བར་རོ། །དབུས་མི་དམིགས་ཞེས་བྱ་བ་ནི་ཡོད་དོ་ཞེས་བྱ་བའམ། མེད་དོ་ཞེས་བྱ་བར་མི་དམིགས་པ་སྟེ།
en: Connect “you cannot apprehend a prior limit of form” with you cannot apprehend at that time “it was there” or “was not there”; “you cannot apprehend a later limit” with at that time “it will be there” or “will not be there”; and “you cannot apprehend a middle” with “it is there” or “is not there.”

source: དེ་ལྟར་དུས་གསུམ་དུ་དབྱེར་མེད་པས་ཆེ་བའོ།
en: Thus, it is “great” because it is not divided into three time periods. “

source: །གཟུགས་ཀྱི་ཚད་ནི་དམིགས་སུ་མེད་དོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་གཟུགས་ལ་འདི་ཙམ་མོ་ཞེས་ཡོངས་སུ་བཅད་པ་མེད་པའི་ཕྱིར་ཚད་མེད་པ་ཉིད་དོ།
en: You cannot apprehend a measure of form”— ultimate form is “immeasurable” because you cannot delineate it as “just this much.”

source: །གྲངས་ཀྱིས་དཔག་ཏུ་མེད་པའི་ཕྱིར་དཔག་ཏུ་མེད་པའོ།
en: It is “infinite” because it cannot be given a size by counting.

source: །སྐད་ཅིག་ཡོངས་སུ་ཆད་པ་མེད་པའི་ཕྱིར་མཐའ་ཡས་པའོ།
en: It is “limitless” because there is no termination of instants.

source: །སྔོན་གྱི་མཐའ་ཞེས་བྱ་བ་ནི་སྐྱེ་བའི་མཐའོ། །ཕྱི་མའི་མཐའ་ཞེས་བྱ་བ་ནི་འགག་པའི་མཐའོ། །དབུས་ཞེས་བྱ་བ་ནི་སྐད་ཅིག་པའི་གནས་སོ།
en: The “prior limit” is production, the “later limit” is cessation, and the “middle” is lasting for an instant.

source: །དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐའ་ཡས་པ་གཅིག་གིས་བསྟན་ནས། དེའི་འོག་ཏུ་མཐའ་ཡས་པ་རྣམ་པ་བཞིས་སྟོན་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མཐའ་ཡས་པ་དང་། ཆོས་ཀྱི་སྐུ་མཐའ་ཡས་པ་དང་། དེ་བཞིན་ཉིད་མཐའ་ཡས་པ་དང་།
en: Having thus at first taught that the perfections are unlimited, it then teaches the unlimited in four parts: the unlimited knowledge of all aspects, the unlimited body of dharmas, unlimited suchness, and unlimited beings.

source: སེམས་ཅན་མཐའ་ཡས་པའོ། །དེ་ལ་སེམས་ཅན་མཐའ་ཡས་པ་ཞེས་བྱ་བ་གང་ཡིན་ཞེ་ན།
en: Among these, what are “unlimited beings”?

source: དེ་མཐའ་ཞེས་བྱ་བ་ནི་མཐའ་གཉིས་ཏེ། རྟག་པའི་མཐའ་དང་ཆད་པའི་མཐའོ།
en: Their “limits” are the two extremes: the permanent extreme and the annihilation extreme.

source: །མཐའ་དེ་གཉིས་མེད་པ་ནི་མཐའ་ཡས་པ་ཉིད་དེ་སེམས་ཅན་གྱི་མཐའ་མེད་པ་ནི་སེམས་ཅན་མཐའ་ཡས་པའོ།
en: The nonexistence of those extremes is the state where the extremes are absent, so beings are “unlimited.”

source: །གལ་ཏེ་སེམས་ཅན་ཡོད་ན་ནི་དེ་ལྟར་གྱུར་ན་མཐའ་དང་ལྡན་པར་འགྱུར་བ་ཞིག་ན་འདི་ལྟར་སེམས་ཅན་ངོ་བོ་ཉིད་ཀྱིས་མེད་པ་ཁོ་ན་སྟེ།
en: Suppose beings existed. In that case they would have limits.

source: དེའི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱི་སེམས་ཅན་མཐའ་ཡས་པ་ཡོད་པ་མ་ཡིན་ནོ།
en: But since beings are in their intrinsic nature just nonexistent, unlimited beings with an intrinsic nature do not exist.

source: །སེམས་ཅན་མཐའ་ཡས་པ་དེ་ཡང་ཆོས་བཤད་པ་འདི་ལ་ཡོད་པ་མ་ཡིན་ནོ། །གལ་ཏེ་ཆོས་བཤད་པ་འདི་ལ་སེམས་ཅན་འགའ་ཞིག་བསྟན་ན་ནི་དེ་ལྟར་གྱུར་ན་སེམས་ཅན་མཐའ་ཡས་པ་ཡང་བསྟན་པར་འགྱུར་བ་ཞིག་ན།
en: Suppose a certain being is taught in this explanation of the doctrine. In that case unlimited beings would also be taught.

source: འདི་ལྟར་སེམས་ཅན་མ་བསྟན་པས་དེའི་ཕྱིར་འདི་ལ་སེམས་ཅན་མཐའ་ཡས་པ་ཡང་མེད་དོ།
en: But since it does not teach a being, there are no unlimited beings here either.

source: །དེ་བས་ན་ཀཽ་ཤི་ཀ་གང་ལ་སེམས་ཅན་དུ་བཤད་པ་གང་ཡང་མེད་པ་དེ་སེམས་ཅན་མཐའ་ཡས་པ་གང་ཡང་མེད་དེ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says, “Kauśika, where there has been no explanation of anything as a being there will also be no limitlessness of a being.”

source: སེམས་ཅན་མ་བསྟན་པའི་ཕྱིར་སེམས་ཅན་མཐའ་ཡས་པ་ཡང་མ་བསྟན་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that because it does not teach a being it therefore also does not teach that beings are unlimited.

source: །དེའི་འོག་ཏུ་ཀཽ་ཤི་ཀ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བཞུགས་ཏེ། སེམས་ཅན་སེམས་ཅན་ཞེས་གསུང་དུ་བརྗོད་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་སེམས་ཅན་མཐའ་ཡས་པ་ཚིག་གི་ཁ་ན་ལས་པ་མ་ཡིན་གྱི།
en: Then, “Kauśika, if a tathāgata, worthy one, perfectly complete buddha remaining for as many eons as there are sand particles in the Gaṅgā River were to say the word being again and again,” and so on, teaches that a statement from the mouth does not make beings unlimited.

source: སེམས་ཅན་མེད་པ་ཉིད་ཀྱི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱིས་མཐའ་ཡས་པའོ་ཞེས་སྟོན་ཏོ།
en: They are unlimited in their intrinsic nature because they are nonexistent.

source: །གལ་ཏེ་སེམས་ཅན་མཐའ་ཡས་པ་ཚིག་གི་ཁར་ལས་པ་ཞིག་ཡིན་ན་ནི་དེ་བཞིན་གཤེགས་པའི་གསུང་ལས་སེམས་ཅན་སྐྱེ་བའམ། འགག་པར་འགྱུར་བ་ཞིག་ན།
en: Suppose beings were made unlimited as a statement in the mouth, that from what the Tathāgata says beings might be born or cease.

source: འདི་ལྟར་དེ་ལྟར་ཡང་མ་གྱུར་ཏེ་དེའི་ཕྱིར་སེམས་ཅན་མཐའ་ཡས་པ་ཚིག་ལས་གྱུར་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means because that is not the case, beings are not unlimited because it has been said they are. “

source: །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན་སེམས་ཅན་མཐའ་ཡས་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐའ་ཡས་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་བཤད་པ་འདི་ལ་སེམས་ཅན་ཞིག་བསྟན་ན་ནི་དེ་ན་དེ་ཡོད་པའི་ཕྱིར་མཐའ་གཉིས་ཀྱང་ཡོད་པར་འགྱུར་ན་དེ་གཉིས་ཀྱང་མ་བསྟན་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པར་འགྱུར་རོ།
en: Kauśika, from this one of many explanations you should know this perfection of wisdom is unlimited because beings are unlimited.” This means suppose a being is taught in this explanation, so it exists in reality. Then the two extremes would also exist. But those two are not taught so this perfection is limitless.

source: །གང་གི་ཕྱིར་སེམས་ཅན་མ་བསྟན་པ་དེའི་ཕྱིར་སེམས་ཅན་མེད་དོ།
en: Because a being is not taught, therefore a being does not exist.

source: །དེ་མེད་པས་མཐའ་གཉིས་ཀྱང་མེད་དོ།
en: Because it does not exist the two extremes do not exist either.

source: །དེ་བས་ན་སེམས་ཅན་མ་བསྟན་པའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་ཞེས་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, because it does not teach a being this perfection is unlimited. “

source: །ཆོས་གང་ལ་ཡང་དམིགས་སུ་མ་མཆིས་ཀྱང་། ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་ཡང་མཆིས་ཏེ་ཞེས་བྱ་བ་ནི་དོན་དམ་པ་དང་ཀུན་རྫོབ་ཏུའོ།
en: Without apprehending any dharma… still they make known the presentation of the three vehicles”— ultimately and conventionally. “

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དམིགས་སུ་མེད་ཅེས་བྱ་བ་ནི་ཆོས་ཀྱི་སྐུའི་དེ་བཞིན་གཤེགས་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: But without apprehending the tathāgata as other than the perfection of giving”— this means the dharma body’s tathāgata is the intrinsic nature of the buddhadharmas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་དེ་ལ་སློབ་པ་ནི་དོན་དམ་པར་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དང་དེ་བཞིན་གཤེགས་པ་ལ་བྱེ་བྲག་མེད་པས་དེ་བཞིན་གཤེགས་པ་ཉིད་དོ་ཞེས་བརྗོད་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: When bodhisattvas train in that, because it is ultimately the intrinsic nature of the buddhadharmas there is also no difference between bodhisattvas and tathāgatas so “you… should therefore call them… just tathāgatas.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་གསར་དུ་སློབ་པ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པས་བསྟན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་དང་མ་བྲལ་བར་གཟིགས་ནས།
en: Since bodhisattvas newly practicing the buddhadharmas are the intrinsic nature of the buddhadharmas, because he would teach, “the tathāgata… Dīpaṅkara,” having seen that he was inseparable from the buddhadharmas, prophesied he would be a tathāgata.

source: དེ་བཞིན་གཤེགས་པར་ལུང་བསྟན་ཏོ་ཞེས་མར་མེ་མཛད་ཀྱི་དཔེ་བསྟན་ཏོ།
en: Thus it gives the example of Dīpaṅkara. “

source: །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ་ཞེས་བྱ་བ་ནི་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཐོབ་པས། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་གཟུགས་མི་ལེན་མི་འདོར་བའི་ཚུལ་དང་ཞེས་བྱ་བ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མཐུན་པར་ཡོངས་སུ་འཛིན་པ་ནི་ངོ་མཚར་ཏོ་ཞེས་བྱ་བ་སྨྲས་ཏེ།
en: Then those gods said to the Lord”— because the Lord had obtained the prophesy from Dīpaṅkara— “It is amazing, Lord, this perfection of wisdom of the bodhisattva great beings, through not appropriating and rejecting form,” up to “is favorable to getting hold of the knowledge of all aspects.”

source: གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་ཁྱད་པར་དུ་འཕགས་པ་དང་། ངན་པའི་དངོས་པོ་མེད་པའི་ཕྱིར་ལེན་པ་དང་འདོར་བ་གཉིས་ཀྱང་མེད་དོ། །འོན་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྔོན་མ་བྱུང་བ་ཡོངས་སུ་འཛིན་པ་དེ་ངོ་མཚར་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means it is amazing that it assists a “knowledge of all aspects” not there before, even though the two, “getting hold of and rejecting,” do not exist, because a real superior or inferior thing in the dharmas, form and so on, does not exist.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་བཞི་པོ་དགེ་སློང་དང་དགེ་སློང་མ་དང་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བཤད་པར་བྱ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བརྩམས་པའོ།
en: Explanation of Chapters 24 to 33 Beneficial qualities Then the Lord, knowing the four retinues of monks, nuns, and so on, takes as its point of departure the Perfection of Wisdom that is being explained.

source: །འདི་མན་ཆད་ནི་དོན་གྱི་བདག་ཉིད་ཀྱི་ཆོས་བཤད་པ་འདིའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་ཚེ་འདི་དང་ཚེ་ཕྱི་མ་ལ་འབྱུང་བ་དང་། བསོད་ནམས་མང་པོ་འཕེལ་བའི་རྒྱུར་གྱུར་པ་སྟོན་ཏོ།
en: It teaches the beneficial qualities that come about in this life and in later lives from this explanation of the Dharma that up to here has constituted the meaning, and that serves as the cause for an increase of much merit. “

source: །སྟོང་པ་ཉིད་ཤིན་ཏུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་རྒྱུ་མཐུན་པ་ཉིད་སྟོན་ཏེ། དེ་ལ་འཇིག་རྟེན་པ་ཐམས་ཅད་སྟོང་པར་སྣང་ལ། བདག་ཀྱང་སྟོང་པར་སྣང་ངོ་།
en: Emptiness becomes a good sustainable position” teaches just a concordant cause with emptiness as the sustainable position, which is to say, to them all ordinary things appear as empty, and the self, too, appears as empty.

source: །འདིར་ཇི་ལྟར་ན་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ལ་གླགས་རྙེད་པར་མི་འགྱུར་བ་སྟོན་ཏོ།
en: Here it teaches why “emptiness finds no way to infiltrate emptiness.”

source: །གང་གིས་གླགས་རྙེད་པར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་སྡིག་པའི་ལས་ཀྱིས་སོ།
en: That “with which they might infiltrate” is wicked action.

source: །གང་དུ་གླགས་རྙེད་པར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་སའི་སྟེང་ངམ། ལྷ་ཡུལ་དུའོ།
en: A level or a place of the gods is “where infiltration might take place.”

source: །གང་ལ་གླགས་རྙེད་པར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྟེ།
en: That “into which infiltration might take place” is a bodhisattva.

source: འདི་ལྟར་དེ་དག་ཐམས་ཅད་མེད་པའི་ཕྱིར་རོ།
en: It is because they are all nonexistent.

source: །འདིར་ནི་གཞུང་བརྡ་ཕྲད་སླ་བས་མ་བྲིས་སོ།
en: I will not spell it out here because the scripture is easy to interpret. “

source: །བསྲུང་བ་དང་བསྐྱབ་པ་དང་སྦ་བར་བགྱིའོ་ཞེས་བྱ་བ་ལ་ལུས་ཀྱི་བདེ་བ་ཐམས་ཅད་སྒྲུབ་པ་ནི་སྲུང་བའོ། །ཕྱི་རོལ་གྱི་གནོད་པ་ལས་སྐྱོབ་པ་ནི་བསྐྱབ་པའོ། །ནང་གི་ནད་ལ་སོགས་པ་བཟློག་པ་ནི་སྦ་བའོ།
en: Guarding, protection, and safekeeping”— “guarding” is establishing all physical well-being; “protection” is defending against all external dangers; and “safekeeping” is stopping internal sickness and so on.

source: །འདིར་ཡང་གླགས་མི་རྙེད་པ་དང་། དུས་མ་ཡིན་པར་འཆི་བ་མེད་པ་དང་། འཇིགས་པ་ལ་སོགས་པ་མི་འབྱུང་བ་དང་། ལྷ་རྣམས་ཀྱིས་བསྲུང་བ་སྟེ། ཕན་ཡོན་རྣམ་པ་བཞི་བསྟན་ཏོ།
en: Here, furthermore, it teaches four benefits: not being infiltrated, not dying an untimely death, not getting scared and so on, and being protected by the gods.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཤ་སྟག་གིས་འདི་ལྟ་སྟེ་དཔེར་ན་བུ་རམ་ཤིང་གི་ཚལ་ལྟར་ཡོངས་སུ་གང་བར་གྱུར་ཞེས་བྱ་བའི་དཔེ་བསྟན་པས་ནི་རིན་ཆེ་བ་བསྟན་ཏོ། །ཚེ་འདིའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་དང་། ཚེ་ཕྱི་མའི་ཕན་ཡོན་དུ་མ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་ལ་སོགས་པ་བཅུ་དང་། སྤྲུལ་པས་ཆོས་སྟོན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་དང་། འཐབ་པ་དང་རྒལ་བ་ལ་སོགས་པ་ཉེ་བར་ཞི་བ་དང་།
en: Teaching by analogy, with “to illustrate, … if this… were filled with śrāvakas and pratyekabuddhas like a thicket of sugarcane,” and so on, it teaches the greater value.

source: དེའི་རྒྱུ་དང་།
en: This teaches the benefits in this life and the many benefits in future lives.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་འཐོབ་པ་དང་། སེམས་འཁྲུགས་པ་ལ་སོགས་པ་མེད་པ་དང་། སྨན་གྱི་དཔེ་དང་། དཀར་པོ་མ་ཡིན་པའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་། སྲུང་བ་དང་དགེ་བའི་ཆོས་མངོན་པར་འཕེལ་བ་དང་། ཚིག་བཙུན་པ་ལ་སོགས་པ་དང་།
en: There are the ten, “a perfect family” and so on; they “magically produce themselves” and teach the doctrine; they “have taken possession of… all the buddhadharmas”; calm those who fight and contradict them and so on; the causes of those; perfectly gaining the six perfections; the absence of being disturbed and so on; the analogy of medicine; stopping all nonbright dharmas; protecting and increasing “wholesome dharmas”; “polite speech” and so on; promotion of the ten wholesome actions; promotion of all the buddhadharmas; and “training perfectly” in each of the six perfections. “

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མངོན་པར་སྦྱོར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་སྦྱོར་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སོ་སོར་ཡང་དག་པར་སློབ་པ་སྟོན་ཏོ། །ཡོངས་སུ་འདུལ་བ་དང་ང་རྒྱལ་མེད་པར་བྱ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་པའི་སྤྱད་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་པ་སྤྱོད་པར་ཡོངས་སུ་འདུལ་བར་ཉེ་བར་གནས་པར་འགྱུར་རོ། །ཐབས་མི་མཁས་པས་ཁེངས་པར་འགྱུར་བ་ལས་ཁེངས་པ་མེད་པར་བྱེད་པར་ཡང་ཉེ་བར་གནས་པ་ཡིན་ནོ།
en: Has been made available in order to tame… and in order to lessen their conceit”— it is “made available” to “bodhisattvas… practicing the ordinary” practices to fully guide them in the pursuit of the career, and it is also “made available” in order to lessen their conceit when “without skillful means” they are conceited.

source: །མི་དམིགས་པར་སྤྱོད་པ་ལ་སྤྱོད་པའི་ཚེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་རྣམ་པ་ཐམས་ཅད་དུ་འདུལ་བས་ན་ཡོངས་སུ་འདུལ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ནོ། །ཁེངས་པར་འགྱུར་བ་མེད་པའི་ཕྱིར་ཁེངས་པར་མི་བྱེད་པར་ཉེ་བར་གནས་པ་ཡིན་ནོ།
en: When they pursue the career “without apprehending” anything and this perfection of wisdom is completely guiding them, it has been made available in order to fully guide them, and been made available in order to lessen their conceit because they do not become conceited.

source: །དེའི་འོག་ཏུ་གཡུལ་ངོར་མཚོན་ཆ་ལས་སྲུང་བ་དང་། དེའི་རྒྱུ་དང་དེའི་ཕྱི་རོལ་གྱི་གནོད་པ་ལས་སྲུང་བ་དང་། དེའི་རྒྱུ་དང་། གླགས་མི་ཐོད་པ་དང་།
en: Merits Then it teaches that it protects from weapons in a battle and the reasons for that; that it protects from external harms and the reasons for that; and that it does not present an opportunity for infiltration.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་དཔེ་དང་བྲིས་ནས་གླེགས་བམ་དུ་བྱས་ཏེ་འཛིན་ཞེས་བྱ་བས་ཚིག་གི་ཚོགས་དང་ཡི་གེའི་ཚོགས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡོན་ཏན་བསྟན་པ་དང་། ས་ཕྱོགས་མཆོད་རྟེན་དུ་འགྱུར་བ་དང་། དེར་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་ཡོངས་སུ་གང་བའི་མཆོད་རྟེན་མཆོད་པ་བས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཆོད་པ་ལྷག་པ་དང་། དེའི་རྒྱུ་དང་། སེམས་ཅན་དམན་པ་མང་བ་དང་།
en: It teaches with the example of the site of awakening; and with “having borne respectfully in mind this perfection of wisdom written out in book form” it teaches the qualities of the perfection of wisdom as a collection of statements and collection of letters.
